app/views/users/users/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
---

	 <% @user.favorites.each do |favorite| %>

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 11]]
---
				<tr>
					<td>この商品のお気に入り数：<%= favorite.restaurant.favorites.count %></td>

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? AND "stocks"."restaurant_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "stocks" WHERE "stocks"."restaurant_id" = ?  [["restaurant_id", 11]]
---
					<td>
						この商品を保存した人たち：<%= favorite.restaurant.stocks.count %>

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
---
		 <% if current_user.following?(@user) %>
    		<%= form_for(current_user.relationships.find_by(follow_id: @user.id), html: { method: :delete }, url: users_relationship_path(@user)) do |f| %>

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ?  [["user_id", 1]]
---
	 	<% end %>
		<% @user.stocks.each do |stock| %>

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 11]]
---
				<tr>
					<td>この商品のお気に入り数：<%= stock.restaurant.favorites.count %></td>

SELECT COUNT(*) FROM "stocks" WHERE "stocks"."restaurant_id" = ?  [["restaurant_id", 11]]
---
					<td>
						この商品をストックした人たち：<%= stock.restaurant.stocks.count %>