app/controllers/admins/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "うどん"], ["created_at", "2019-09-25 09:41:51.774449"], ["updated_at", "2019-09-25 09:41:51.774449"]]
---
	def create
		@genre = Genre.new(genre_params)
		if @genre.save