app/controllers/admins/stations_controller.rb

SELECT "stations".* FROM "stations"
---
	def index
		@stations = Station.all

INSERT INTO "stations" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "北与野"], ["address", "埼玉県さいたま市中央区上落合２"], ["created_at", "2019-09-25 04:15:14.186714"], ["updated_at", "2019-09-25 04:15:14.186714"]]
---
	def create
		@station = Station.new(station_params)
		if @station.save

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
	def show
		@station = Station.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@station = Station.find(params[:id])

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stations" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "stations"."id" = ?  [["name", "松江"], ["address", "島根県松江市"], ["updated_at", "2019-09-25 09:44:04.701085"], ["id", 17]]
---
	def update
		@station = Station.find(params[:id])
		if @station.update(station_params)