app/views/admins/stations/show.html.erb

SELECT "station_trains".* FROM "station_trains" WHERE "station_trains"."station_id" = ?  [["station_id", 3]]
---
<h2>交通アクセス</h2>
<% @station.station_trains.each do |s_t| %>