app/views/admins/genres/index.html.erb

SELECT COUNT(*) FROM "restaurants" WHERE "restaurants"."genre_id" = ?  [["genre_id", 1]]
---
				<td><%= link_to genre.name, admins_genre_path(genre.id) %></td>
				<td>このジャンルの店の数:<%= genre.restaurants.count %></td>