app/views/admins/genres/show.html.erb

				<h1><%= @genre.name %></h1>
				<p>このジャンルの店の数:<%= @genre.restaurants.count %></p>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."genre_id" = ?  [["genre_id", 14]]
SELECT COUNT(*) FROM "restaurants" WHERE "restaurants"."genre_id" = ?  [["genre_id", 14]]

				<%= link_to "削除", admins_genre_path(@genre.id), method: :delete, "data-confirm" => "本当に削除しますか？" %>
				<% @genre.restaurants.each do |restaurant| %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."genre_id" = ?  [["genre_id", 15]]

							<tr>
								<td>この商品のお気に入り数：<%= restaurant.favorites.count %></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 4]]

							<tr>
								<td>この商品を保存した人たち：<%= restaurant.stocks.count %></td>
---
SELECT COUNT(*) FROM "stocks" WHERE "stocks"."restaurant_id" = ?  [["restaurant_id", 5]]