app/views/users/restaurants/edit.html.erb

SELECT "genres".* FROM "genres"
---
        			<%= f.label :genre_id, "ジャンル" %><br />
        			<%= f.collection_select :genre_id, Genre.all, :id,:name %>

SELECT "stations".* FROM "stations"
---
        			<%= f.label :station_id, "最寄り駅" %><br />
        			<%= f.collection_select :station_id, Station.all, :id, :name %>