app/views/users/restaurants/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 14]]
---
								<tr>
									<td>この商品のお気に入り数：<%= restaurant.favorites.count %></td>

SELECT COUNT(*) FROM "stocks" WHERE "stocks"."restaurant_id" = ?  [["restaurant_id", 14]]
---
								<tr>
									<td>この商品をストックした人たち：<%= restaurant.stocks.count %></td>