app/views/users/restaurants/new.html.erb

        			<%= f.label :genre_id, "ジャンル" %><br />
        			<%= f.collection_select :genre_id, Genre.all, :id,:name %>
---
SELECT "genres".* FROM "genres"

        			<%= f.label :station_id, "最寄り駅" %><br />
        			<%= f.collection_select :station_id, Station.all, :id, :name %>
---
SELECT "stations".* FROM "stations"