app/views/users/restaurants/show.html.erb

					<tr>
						<td>この商品のお気に入り数：<%= @restaurant.favorites.count %></td>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 11], ["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 21]]

					<tr>
						<td>この商品をストックした人たち：<%= @restaurant.stocks.count %></td>
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? AND "stocks"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 11], ["LIMIT", 1]]
SELECT COUNT(*) FROM "stocks" WHERE "stocks"."restaurant_id" = ?  [["restaurant_id", 21]]