app/views/users/stations/show.html.erb

<h2>交通アクセス</h2>
<% @station.station_trains.each do |s_t| %>
---
SELECT "station_trains".* FROM "station_trains" WHERE "station_trains"."station_id" = ?  [["station_id", 12]]

	<% end %>
	<% @station.restaurants.each do |restaurant| %>
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."station_id" = ?  [["station_id", 12]]