app/models/user.rb

INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["follow_id", 1], ["created_at", "2019-09-27 15:18:39.817209"], ["updated_at", "2019-09-27 15:18:39.817209"]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]
---
	def follow(other_user)
    	unless self == other_user
			self.relationships.find_or_create_by(follow_id: other_user.id)