app/controllers/users/favorites_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "restaurant_id") VALUES (?, ?)  [["user_id", 1], ["restaurant_id", 21]]
---
	def create
		restaurant = Restaurant.find(params[:restaurant_id])
		favorite = current_user.favorites.new(restaurant_id: restaurant.id)
		if favorite.save