app/controllers/users/restaurants_controller.rb

	def index
		@restaurants = Restaurant.all
		@q = Restaurant.ransack(params[:q])
  	@restaurants = @q.result(distinct: true)
		@users = User.all
		@user = current_user
		@stations = Station.all
		@q = Station.ransack(params[:q])
  	@stations = @q.result(distinct: true)
  	@favorites = Favorite.all
		@all_ranks = Restaurant.find(Favorite.group(:restaurant_id).order('count(restaurant_id) desc').limit(10).pluck(:restaurant_id))
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."restaurant_id" = ?  [["restaurant_id", 11]]

	def show
		@restaurant = Restaurant.find(params[:id])
		@q = Restaurant.ransack(params[:q])
  	@restaurants = @q.result(distinct: true)
		@favorite = Favorite.find_by(user: current_user, restaurant: @restaurant)
		@stock = Stock.find_by(user: current_user, restaurant: @restaurant)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 11], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? AND "stocks"."restaurant_id" = ? LIMIT ?  [["user_id", 1], ["restaurant_id", 11], ["LIMIT", 1]]

	def create
		@restaurant = Restaurant.new(restaurant_params)
		if @restaurant.save
---
INSERT INTO "restaurants" ("name", "genre_id", "menu", "budget", "postal_code", "address", "station_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@user = current_user
		@restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

	def update
		@restaurant = Restaurant.find(params[:id])
		@restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = ?, "station_id" = ?, "postal_code" = ?, "address" = ?, "budget" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "慎"], ["station_id", 13], ["postal_code", ""], ["address", "東京都渋谷区代々木"], ["budget", 650], ["updated_at", "2019-10-01 14:42:34.935863"], ["id", 14]]