app/controllers/users/stations_controller.rb

SELECT  "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
	def show
		@user = current_user
		@station = Station.find(params[:id])