app/controllers/users/stocks_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "stocks" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 21], ["created_at", "2019-10-01 14:39:47.865862"], ["updated_at", "2019-10-01 14:39:47.865862"]]
---
	def create
		restaurant = Restaurant.find(params[:restaurant_id])
		stock = current_user.stocks.new(restaurant_id: restaurant.id)
		stock.save