app/controllers/users/users_controller.rb

	def show
		@user = User.find(params[:id])
		@id = @user.id
		@followers = @user.followings
		@q = Restaurant.ransack(params[:q])
  	@restaurants = @q.result(distinct: true)
		@stock = Stock.find_by(user: @user, restaurant: @restaurant)
		@favorite = Favorite.find_by(user: @user, restaurant: @restaurant)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? AND "stocks"."restaurant_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_id" IS NULL LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "introduction" = ? WHERE "users"."id" = ?  [["image_id", nil], ["introduction", "kokokokok"], ["id", 1]]

	def withdrawal
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy #論理削除
		@user = User.find(params[:id])
		@user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]